# Python Assignment : 5 ( Read and Write CSV and XLS files )

#### Name: Rajput Pruthviraj Dineshsing
#### Class: BE (Computer)
#### Div: B
#### Roll No: 37

# Read and Write CSV and XLS files

In [12]:
# import panads
import pandas as pd

In [13]:
# Read opration using pandas
df = pd.read_csv('weather_data.csv')

In [14]:
# Read CSV file
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [16]:
# read excel file
df = pd.read_excel('weather_data.xlsx')

df

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02           35          7  Sunny
2 2017-01-03           28          2   Snow

In [18]:
# write DF to csv

df.to_csv('new.csv')
df.to_csv('new_noIndex.csv', index=False)

In [19]:
#  write Df to Excel ( install openpyxl)

# write DF to Excel 
df.to_excel('new.xlsx', sheet_name='weather_data')

# Group By

In [20]:
# import Pandas
import pandas as pd

In [21]:
# read csv file
df = pd.read_csv('weather_by_cities.csv')

# show wheather by cities
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [23]:
g = df.groupby('city')
g

In [25]:
for city, city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [27]:
# gert specific group
g.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [28]:
# Find maximum temperature in each of the cities
print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [29]:
print(g.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [33]:
print(g.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# Concatenate Data Frames

In [35]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ["mumbai", "delhi","banglore"],
    "temperature": [80, 60, 78],
    "humidity": [80, 60, 78]
})

india_weather

       city  temperature  humidity
0    mumbai           80        80
1     delhi           60        60
2  banglore           78        78

In [36]:
us_weather = pd.DataFrame({
    "city": ["new york", "chicago", "orlando"],
    "temperature": [21, 14, 35],
    "humidity": [68, 65, 75]
})

us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [38]:
#  concate two data frames
df = pd.concat([india_weather, us_weather])
df

       city  temperature  humidity
0    mumbai           80        80
1     delhi           60        60
2  banglore           78        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [39]:
# if you want continuous index
df = pd.concat([india_weather, us_weather], ignore_index = True)
df

       city  temperature  humidity
0    mumbai           80        80
1     delhi           60        60
2  banglore           78        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [41]:
df = pd.concat([india_weather, us_weather], axis=1)
df

       city  temperature  humidity      city  temperature  humidity
0    mumbai           80        80  new york           21        68
1     delhi           60        60   chicago           14        65
2  banglore           78        78   orlando           35        75

# Merge DataFrames

In [42]:
temperature_df = pd.DataFrame({
    "city": ["mumbai", "delhi","banglore", "hyderabad"],
    "temperature": [33, 45, 30, 40],
})

temperature_df

        city  temperature
0     mumbai           33
1      delhi           45
2   banglore           30
3  hyderabad           40

In [43]:
humidity_df = pd.DataFrame({
    "city": ['delhi', 'mumbai', 'banglore'],
    "humidity": [68, 65, 75]
})
humidity_df

       city  humidity
0     delhi        68
1    mumbai        65
2  banglore        75

In [44]:
# merge two dataframes with out explicitly mention index
df = pd.merge(temperature_df, humidity_df, on='city')
df

       city  temperature  humidity
0    mumbai           33        65
1     delhi           45        68
2  banglore           30        75

In [47]:
# outer join
df = pd.merge(temperature_df, humidity_df, on='city', how='outer')
df

        city  temperature  humidity
0     mumbai           33      65.0
1      delhi           45      68.0
2   banglore           30      75.0
3  hyderabad           40       NaN

# Numerical Indexing (.loc vs iloc)

In [66]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,19])
df

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  19

In [67]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,19], index=[49,48,47,46,45,1,2,3,4,5])
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   19

In [79]:
df.loc[46]

0    4
Name: 46, dtype: int64

In [81]:
df.loc[:2]

    0
49  1
48  2
47  3
46  4
45  5
1   6
2   7

In [83]:
df.iloc[3]

0    4
Name: 46, dtype: int64

In [84]:
df.iloc[:2]

    0
49  1
48  2

In [85]:
df.loc[45]

0    5
Name: 45, dtype: int64

In [86]:
df.iloc[45]

IndexError: single positional indexer is out-of-bounds

In [89]:
df.loc[:2]

    0
49  1
48  2
47  3
46  4
45  5
1   6
2   7

In [90]:
df.iloc[:2]

    0
49  1
48  2